app/controllers/session_controller.rb

    def create
      # binding.pry
      user = User.find_by user_name: params[:user_name]
---
SELECT  "users".* FROM "users" WHERE "users"."user_name" = $1 LIMIT $2  [["user_name", "grant"], ["LIMIT", 1]]